#pragma once

#include "BM_Recursos_Sprites.h"

//==========================================================================
// Lista de animações pendentes
//==========================================================================
typedef struct BM_ANIMACAO_LISTA_S
{
	struct BM_ANIMACAO_LISTA_S *anterior;
	BM_SPRITES *sprite;
	int renderX;
	int renderY;
	struct BM_ANIMACAO_LISTA_S *proximo;
}BM_ANIMACAO_LISTA_S;
//==========================================================================

//==========================================================================
// Adicionar animação
//==========================================================================
int BM_Animacao_adicionar(BM_SPRITES *_sprite, int _renderX, int _renderY);
//==========================================================================

//==========================================================================
// Remover animação
//==========================================================================
void BM_Animacao_remover(int _posicao);
//==========================================================================